app/controllers/pins_controller.rb

  def create
    @pin = current_user.pins.build(pin_params)

    respond_to do |format|
      if @pin.save
---
INSERT INTO "pins" ("description", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "board_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def show_repost
    @pin = Pin.find(params[:id])
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = ? LIMIT 1  [["id", 2]]

  def like
    @like = @pin.likes.build(user_id: current_user.id)
    if @like.save
---
INSERT INTO "likes" ("user_id", "pin_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["pin_id", 2], ["created_at", "2018-02-09 00:18:10.675675"], ["updated_at", "2018-02-09 00:18:10.675675"]]